app/views/events/index.html.erb

SELECT  1 AS one FROM "events" WHERE (Date >= '2018-01-08') LIMIT ?  [["LIMIT", 1]]
---
<h2>Upcoming Events</h2>
<% if Event.upcoming.any? %>